exports.template = (data, employees) => {

    return `<!DOCTYPE html>
    <html lang="en" xmlns="http://www.w3.org/1999/xhtml" xmlns:o="urn:schemas-microsoft-com:office:office">
    
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width,initial-scale=1">
        <meta name="x-apple-disable-message-reformatting">
        <title></title>
        <!--[if mso]>
              <noscript>
                <xml>
                  <o:OfficeDocumentSettings>
                    <o:PixelsPerInch>96</o:PixelsPerInch>
                  </o:OfficeDocumentSettings>
                </xml>
              </noscript>
              <![endif]-->
        <style>
            table,
            td,
            div,
            h1,
            p {
                font-family: Arial, sans-serif;
            }
        </style>
    </head>
    <body>
    <p>Број ____ од _________година Вработен шифра ________ (пополнува Банката)</p>
    <p><strong>Барање за издавање на дебитна платежна картичка на физичко лице</strong></p>
    <p>Mastercard Debit Contactless Visa PayWave Electron Visa Platinum</p>
    <p>Име и презиме: ________________________________________________________________________________________</p>
    <p>Име и презиме: ________________________________________________________________________________________</p>
    <p>(на латиница)</p>
    <p>Адреса од л.к: _________________________________________________________________________________________</p>
    <p>Адреса на живеење: ____________________________________________________________________________________</p>
    <p>(не е задолжително доколку адресата е иста со личната карта)</p>
    <p>Домашен тел: ______________________________________________Тел. на работа:_______________________________</p>
    <p>Мобилен тел: ______________________________________________</p>
    <p>Лична карта бр: ____________________________________________</p>
    <p>ЕМБГ:_____________________________________________________</p>
    <p>E-Маил: ___________________________________________________</p>
    <p>Податоци за плата/ пензија:</p>
    <p>Да, примам плата/пензија во Халкбанк АД Скопје</p>
    <p>Ќе пренесам плата/пензија во Халкбанк АД Скопје</p>
    <p>Нема да ја пренесам платата/пензијата во Халкбанк АД Скопје</p>
    <p>Број на платежна сметка во банката:</p>
    <p>денарска платежна сметка____________________________________________________________________________</p>
    <p>платежна сметка со основни функции __________________________________________________________________</p>
    <p>платежна сметка со основни функции за корисници на законски права ______________________________________</p>
    <p>Во прилог на барањето за издавање на дебитна платежна картичка доставувам:</p>
    <p>-пополнето и потпишано барање</p>
    <p>-фотокопија од лична карта</p>
    <p>Име и презиме: ________________________________________________________________________________________</p>
    <p>Име и презиме: ________________________________________________________________________________________</p>
    <p>(на латиница)</p>
    <p>Адреса од л.к: _________________________________________________________________________________________</p>
    <p>Мобилен тел: ______________________________________________</p>
    <p>Лична карта бр: ____________________________________________</p>
    <p>ЕМБГ:_____________________________________________________</p>
    <p>Е-маил:____________________________________________________</p>
    <p>*Јас долупотпишаниот своерачно под полна морална, материјална и кривична одговорност ја потврдувам точноста на податоците дадени во ова барање. За секоја</p>
    <p>промена на податоците се обврзувам дека навремено и писмено ќе ја известам Банката согласно одредбите од Законот. Во спротивно Банката не одговара за</p>
    <p>евентуалните штетни последици од настанатите промени. Со потпишување на ова барање, потврдувам дека сите наведени податоци се вистинити и прифаќам</p>
    <p>одговорност за сите трошоци и долгови кои настанале со користење на основната и дополнителната платежна картичка. Банката има право да го одбие моето барање.</p>
    <p>Информиран сум дека моите лични податоци во врска со овој предмет, вклучувајќи го и мојот единствен матичен број на граѓанинот (ЕМБГ), Банката ги користи при</p>
    <p>вршење на работите кои произлегуваат од делокругот на нејзиното работење, а за цел и во врска со поднесеното барање: обработка, одобрување, следење, пренесување</p>
    <p>на други овластени бази на податоци (вклучително и проверка во бази на податоци достапни преку матичната банка во Р. Турција, за државјани на Р. Турција) и/или</p>
    <p>други дејствија во рамките на банкарското работење, според прописите и актите од делокруг на работењето на Банката согласно закон, а во корелација со прописите за</p>
    <p>заштита на личните податоци.</p>
    <p>За секоја промена на личните податоци (вклучувајќи ги и адресните податоци) се обврзувам дека навремено во рок од три работни дена и писмено ќе ја известам</p>
    <p>Банката согласно Општи услови и претходни информации за обезбедување и користење на платежни услуги за физички лица во Халкбанк АД Скопје. Во спротивно, секоја</p>
    <p>достава од страна на Банката до клиентот се смета дека е уредно извршена на адресата на живеење, наведена во Барањето и Банката не одговара за евентуалните</p>
    <p>штетни последици од настанатите промени.</p>
    <p>-Ги прифаќам рамковните општи услови и поединечните општи услови за издавање и користење на дебитни платежни картички за физички лица издадени од Халкбанк</p>
    <p>АД Скопје;</p>
    <p>Исто така согласен сум моите лични податоци Банката:</p>
    <p>да ги користи за цели на директен маркетинг*</p>
    <p>да не ги користи за цели на директен маркетинг*</p>
    <p>*Клиентот кој се согласил неговите лични податоци да бидат користени за цели на директен маркетинг има право во секое време, без надоместок со писмено барање</p>
    <p>до Банката да побара неговите лични податоци да не бидат користени за цели на директен маркетинг.</p>
    <p>Барњето за дебитна платежна картичка е создадено во електронска форма како електронски документ и потврдено од страна на Барателот на дебитна платежна картичка со авторизација преку каналите на електронско и/или мобилно банкарство.<br /> <br /> Барателот на дебитна платежна картичка потврдува дека е запознаен дека Банката барањето за дебитна платежна картичка ќе го чува во електронски облик и потврдува дека нема да покренува судска постапка во однос на формата на ова Барање.<br /> &nbsp;</p>
    <p>Место и датум ___________________________________________________</p>
    <p>ФК 7.5.1.10.1</p>
    <p><strong>ДОПОЛНИТЕЛНА ПЛАТЕЖНА КАРТИЧКА ЗА ОВЛАСТЕНО ЛИЦЕ/ ЧЛЕН НА ПОТЕСНО СЕМЕЈСТВО</strong></p>
    <p><strong>ОСНОВНИ </strong><strong>ПОДАТОЦИ </strong><strong>ЗА КОРИСНИКОТ</strong></p>
    </body>
    </html>`
};